org/study/sec/windows.org
#+title: Windows
#+options: num:nil author:nil timestamp:nil date:nil
#+setupfile: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* Commands
** netsh

+ [[https://www.thewindowsclub.com/disable-wifi-using-cmd-or-powershell][How to disable WiFi using CMD or Powershell in Windows 11/10 - TheWindowsClub]]

Disconnect from Wi-Fi network.
#+begin_src cmd
netsh wlan disconnect
#+end_src

Connect to a specific Wi-Fi connection.
#+begin_src cmd
netsh wlan connect name="<network-name>"
#+end_src

See the available interfaces.
#+begin_src cmd
netsh wlan show interfaces
#+end_src

Disable an interface.
#+begin_src cmd
netsh interface set interface name="Wi-Fi" admin=DISABLED
#+end_src

Re-enable an interface.
#+begin_src text
netsh interface set interface name="Wi-Fi" admin=ENABLED
#+end_src

*Powershell*

Get interfaces.
#+begin_src pwsh
Get-NetAdapter | format-table
#+end_src

Disable an interface.
#+begin_src pwsh
Disable-NetAdapter -Name "Adapter-Name" -Confirm:$false
#+end_src

Re-enable an interface.
#+begin_src pwsh
Enable-NetAdapter -Name "Adapter-Name" -Confirm:$false
#+end_src

* Tips
** Temporarily disable the Wi-Fi

*Useful when doing a Windows (10/11) install* but forgetting to set up the user before the Wi-Fi. We can temporarily disable the network interface with ~netsh~.

Press ~Shift~ + ~F10~.

See the available interfaces.
#+begin_src cmd
netsh wlan show interfaces
#+end_src

The name of the interface will be the one to use on the next command, in this case "Wi-Fi".
#+begin_src cmd
netsh interface set interface name="Wi-Fi" admin=DISABLED
#+end_src

Enable the interface again.
#+begin_src cmd
netsh interface set interface name="Wi-Fi" admin=ENABLED
#+end_src
